{
  "classics": [
    {
      "id": "heart-sutra",
      "title": "般若波罗蜜多心经",
      "shortTitle": "心经",
      "description": "《心经》是般若经类的核心与纲要，全文仅260字，却含摄了六百卷《大般若经》的要义。它主要阐述了空的智慧，说明万事万物的本质都是因缘和合而生，没有固定不变的实体。",
      "importance": [
        "简洁精要：篇幅极短，便于初学者读诵、记忆，是快速了解佛教核心智慧的捷径",
        "破除执念：帮助初学者理解无我、无常的道理，放下对外在事物和自我观念的执着",
        "智慧核心：《心经》是整个佛法智慧的核心，理解了它，就等于抓住了佛法的心要"
      ],
      "quotes": [
        {
          "text": "色不异空，空不异色；色即是空，空即是色。",
          "explanation": "我们所看到的物质世界（色）与空性的本质没有区别；物质世界本身就是空性的显现，而空性也蕴含在物质世界之中。这并非说什么都没有，而是说一切事物的存在都不是孤立、永恒的，而是相互依存、不断变化的。"
        },
        {
          "text": "是诸法空相，不生不灭，不垢不净，不增不减。",
          "explanation": "一切法的空性实相是超越了我们凡夫的二元对立概念的。它没有生与灭的对立，没有垢与净的分别，也没有增与减的变化。这是从事物的究竟本质上来说的。"
        },
        {
          "text": "心无挂碍，无挂碍故，无有恐怖，远离颠倒梦想，究竟涅槃。",
          "explanation": "当内心没有任何牵挂和执着时，就不会有恐惧和担忧。能够远离那些不切实际的、错误的念头和幻想，最终达到彻底解脱、宁静自在的境界（涅槃）。"
        }
      ],
      "image": "/images/lotus-flower.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0251"
    },
    {
      "id": "diamond-sutra",
      "title": "金刚般若波罗蜜经",
      "shortTitle": "金刚经",
      "description": "《金刚经》是大乘佛教般若部的核心经典之一，禅宗尤为推崇此经。它通过佛陀与弟子须菩提的对话，反复阐述无相、无住、无我的空性智慧，强调菩萨应发度尽一切众生之心，但又不见有任何众生被我所度。",
      "importance": [
        "破除相执：帮助初学者破除对一切外在相（如佛相、法相、众生相）的执着",
        "建立正见：引导初学者建立应无所住而生其心的正确发心",
        "福慧双修：强调在行布施、持戒等善行的同时，必须以般若智慧为引导"
      ],
      "quotes": [
        {
          "text": "凡所有相，皆是虚妄。若见诸相非相，即见如来。",
          "explanation": "一切我们所能感知到的外在表象，本质上都是虚幻不实的。如果能透过这些表象，看到它们虚幻的本质（非相），那就等于见到了佛的法身真理（如来）。"
        },
        {
          "text": "应无所住，而生其心。",
          "explanation": "内心不应该执着于任何事物或念头（无所住），并在此基础上生起清净、无染的慈悲心和菩提心。这是《金刚经》的精髓，也是六祖慧能大师开悟的关键所在。"
        },
        {
          "text": "过去心不可得，现在心不可得，未来心不可得。",
          "explanation": "我们的心念是刹那生灭、迁流不息的。想要抓住过去的念头，它已消逝；想要抓住现在的念头，它立即成为过去；想要抓住未来的念头，它尚未到来。这旨在说明心念的虚幻无常，从而让我们放下对念头的执着。"
        },
        {
          "text": "一切有为法，如梦幻泡影，如露亦如电，应作如是观。",
          "explanation": "一切依靠因缘条件而存在的事物（有为法），都像梦境、幻术、水泡、影子、露水和闪电一样，短暂易逝，虚幻不实。我们应该这样去看待世间的一切。"
        }
      ],
      "image": "/images/buddhist-scripture.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0235"
    },
    {
      "id": "lotus-sutra",
      "title": "妙法莲华经",
      "shortTitle": "法华经",
      "description": "《法华经》是大乘佛教的根本经典之一，被誉为经中之王。核心思想是开权显实、会三归一，即佛陀以往所说的声闻、缘觉、菩萨三乘教法，都只是方便说，最终目的都是为了引导众生达成唯一的佛乘。",
      "importance": [
        "建立信心：明确告诉每一位众生，无论根基如何，都有成佛的可能性",
        "理解佛陀本怀：帮助初学者理解佛陀教法的圆融与究竟",
        "普世精神：体现了佛陀对一切众生无分别的慈悲"
      ],
      "quotes": [
        {
          "text": "若有闻法者，无一不成佛。",
          "explanation": "只要能听闻到《法华经》所说的妙法，并升起信解之心，未来必定能够成佛。"
        },
        {
          "text": "三界无安，犹如火宅，众苦充满，甚可怖畏。",
          "explanation": "我们所处的欲界、色界、无色界（三界）就像一座着火的房子，动荡不安，充满了各种痛苦，是非常可怕的。佛陀以此比喻，劝诫众生精进修行，早日脱离轮回之苦。"
        },
        {
          "text": "我为众生故，广说无量喻。……为度众生故，方便说诸法。",
          "explanation": "佛陀为了度化不同根性的众生，用各种各样的比喻和方便法门来教化他们，其根本目的只有一个，就是引导他们走向解脱。"
        }
      ],
      "image": "/images/zen-background.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0262"
    },
    {
      "id": "amitabha-sutra",
      "title": "佛说阿弥陀经",
      "shortTitle": "阿弥陀经",
      "description": "《阿弥陀经》是净土宗的核心经典之一。经中，释迦牟尼佛无问自说，描述了西方极乐世界的庄严美好，并开示了往生该净土的简易方法——执持名号，即专心称念阿弥陀佛的名号。",
      "importance": [
        "提供明确归宿：为初学者提供了一个明确、美好的修行目标",
        "法门简单易行：执持名号的修行方法非常简单，人人都可以实践",
        "带业往生：允许修行者带着尚未断除的烦恼（业）往生净土"
      ],
      "quotes": [
        {
          "text": "不可以少善根福德因缘，得生彼国。",
          "explanation": "想要往生到阿弥陀佛的极乐世界，不能依靠微少的善根、福德和因缘。这反过来提示我们，需要深信、切愿、力行，积累足够的资粮。"
        },
        {
          "text": "执持名号，若一日、若二日、若三日、若四日、若五日、若六日、若七日，一心不乱。",
          "explanation": "如果有人能专心致志地称念阿弥陀佛的名号，持续一天到七天，达到心念专一、不起杂念的境界，临终时就能蒙佛接引，往生极乐世界。"
        },
        {
          "text": "是诸善男子、善女人，皆为一切诸佛之所护念，皆得不退转于阿耨多罗三藐三菩提。",
          "explanation": "那些一心念佛的人，会得到十方一切诸佛的共同护佑和想念，并且最终都能在成佛的道路上达到永不退转的境地。"
        }
      ],
      "image": "/images/prayer-beads.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0366"
    },
    {
      "id": "ksitigarbha-sutra",
      "title": "地藏菩萨本愿经",
      "shortTitle": "地藏经",
      "description": "《地藏经》是一部记述地藏菩萨大孝与大愿的经典。经中讲述了地藏菩萨在因地修行时，为救度母亲而发下地狱未空，誓不成佛；众生度尽，方证菩提的宏大誓愿。",
      "importance": [
        "强调孝道与因果：浅显易懂地阐释了孝亲尊师、因果报应的道理",
        "建立慈悲心：通过地藏菩萨的无尽悲愿，启发初学者的慈悲心",
        "认识六道轮回：清晰地描绘了地狱等恶道的苦状"
      ],
      "quotes": [
        {
          "text": "地狱未空，誓不成佛；众生度尽，方证菩提。",
          "explanation": "这是地藏菩萨所发的宏大誓愿。意思是只要地狱里还有一个众生没有被度脱，我就誓不成佛；直到所有众生都被度尽，我才最终证得佛果。"
        },
        {
          "text": "若有众生，不孝父母，或至杀害，当堕无间地狱，千万亿劫，求出无期。",
          "explanation": "经文明确警示，不孝顺父母，甚至杀害父母的人，会堕入最痛苦的无间地狱，经历极长时间的苦难，很难有出离的机会。这是在强调孝道的重要性。"
        },
        {
          "text": "我观是阎浮众生，举心动念，无非是罪。",
          "explanation": "地藏菩萨观察我们这个世界（南阎浮提）的众生，发现大家起心动念之间，夹杂了太多的贪、嗔、痴等烦恼，常常在不自觉中造下罪业。这提醒我们要时刻观照自己的内心。"
        }
      ],
      "image": "/images/bodhi-leaf.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0412"
    },
    {
      "id": "platform-sutra",
      "title": "六祖大师法宝坛经",
      "shortTitle": "六祖坛经",
      "description": "《六祖坛经》是中国佛教史上唯一一部由中国人所说，而被尊称为经的著作。它记录了禅宗六祖慧能大师的生平、开悟的经历，以及对弟子们的开示。核心思想是直指人心，见性成佛。",
      "importance": [
        "树立内心自信：强调佛性本有，人人皆可成佛",
        "禅法入门：提供了顿悟禅法的核心理论和实践方法",
        "生活即是修行：将修行与日常生活融为一体"
      ],
      "quotes": [
        {
          "text": "菩提本无树，明镜亦非台。本来无一物，何处惹尘埃。",
          "explanation": "这是慧能大师悟道时所作的偈子。意思是，清净的自性（菩提）本不像一棵树，光明的内心也不像一个镜台。自性本来就是清净空寂、无形无相的，又哪里会染上尘埃呢？"
        },
        {
          "text": "何期自性，本自清净；何期自性，本不生灭；何期自性，本自具足；何期自性，本无动摇；何期自性，能生万法。",
          "explanation": "慧能大师在开悟时一连用了五个何期（没想到）来赞叹我们的自性。没想到自性本来就是清净的，不生不灭的，圆满具足一切功德的，如如不动的，并且能生出宇宙万法。"
        },
        {
          "text": "佛法在世间，不离世间觉。离世觅菩提，恰如求兔角。",
          "explanation": "真正的佛法就在我们的日常生活中，觉悟也离不开现实世界。如果离开现实生活去寻找觉悟（菩提），就好像要寻找兔子头上的角一样，是根本不可能找到的。"
        }
      ],
      "image": "/images/zen-stones.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T2008"
    },
    {
      "id": "avatamsaka-sutra",
      "title": "大方广佛华严经",
      "shortTitle": "华严经",
      "description": "《华严经》被誉为经中之王，其核心思想是法界缘起和事事无碍。它揭示了整个宇宙是一个重重无尽、互融互即的华严世界（一真法界）。经中认为，一即是多，多即是一，一粒微尘中可显现三千大千世界，一切万法皆是毗卢遮那佛（法身佛）的显现。",
      "importance": [
        "开拓心胸格局：学习《华严经》可以极大地开拓人的心量和视野，让人超越狭隘的自我",
        "建立圆融正见：帮助理解佛法中一多相容、理事无碍的圆融思想",
        "激发普贤行愿：经中的普贤菩萨十大行愿是菩萨道的典范，能激励初学者发起利益一切众生的广大心愿"
      ],
      "quotes": [
        {
          "text": "若人欲了知，三世一切佛，应观法界性，一切唯心造。",
          "explanation": "如果有人想要了知过去、现在、未来一切诸佛的境界，就应当观察整个宇宙（法界）的本性，那就是一切万法无非都是由我们的心所造就、所显现的。"
        },
        {
          "text": "一切众生，皆具如来智慧德相，但因妄想执着，不能证得。",
          "explanation": "所有的众生，都本来就圆满具足了和佛一样的智慧与功德。但因为被虚妄的念头和顽固的执着所障碍，所以无法亲自证得和体验到它。"
        },
        {
          "text": "心如工画师，能画诸世间。五蕴悉从生，无法而不造。",
          "explanation": "我们的心就像一位技艺高超的画师，能够描绘出各式各样的世界。我们所经验到的色、受、想、行、识这五蕴（构成身心的要素）都由心而生，没有什么不是心所创造的。"
        },
        {
          "text": "一尘中有尘数刹，一一刹有难思佛。",
          "explanation": "在一粒微尘之中，就包含了无量无数的佛国刹土；在每一个佛国刹土中，又有无数不可思议的佛在其中说法度众。这形象地说明了华严境界中重重无尽、大小互含的玄妙景象。"
        }
      ],
      "image": "/images/lotus-flower.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0279"
    },
    {
      "id": "lankavatara-sutra",
      "title": "楞伽阿跋多罗宝经",
      "shortTitle": "楞伽经",
      "description": "《楞伽经》是唯识宗和禅宗的重要典籍，其核心思想是万法唯心、三界唯心，唯识所现。它深入剖析了人类的认识来源，指出我们所感知到的一切外部世界，实际上都是我们内心阿赖耶识（根本识）所显现的影像。",
      "importance": [
        "认识心的运作：帮助初学者深入了解自己内心的运作机制，明白念头、情绪和外境的相互关系",
        "勘破虚妄：提供了一切都是自心显现的强大观修方法，有助于在面对烦恼和困境时，勘破其虚幻性",
        "禅宗印心：此经是禅宗初祖达摩传给二祖慧可，用以印心的经典，对于理解禅宗直指人心的法门有重要意义"
      ],
      "quotes": [
        {
          "text": "彼所见非有，是心自心见。",
          "explanation": "我们所看到的外部世界并非真实、独立的存在，它其实是我们的心看到了自己（的变现）。"
        },
        {
          "text": "由自心执着，心似外境转，彼所见非有，是故说唯心。",
          "explanation": "因为我们内心生起了执着，心就仿佛随着外境而转动。但实际上所见的外境并非实有，所以佛说一切唯心。"
        },
        {
          "text": "不坏于相，而随入自心现量。",
          "explanation": "修行并不是要毁灭或逃避眼前的世界（相），而是在不破坏这一切表象的前提下，了知它们都只是自心的显现。"
        },
        {
          "text": "观察一切法，通达无所有。",
          "explanation": "深入地观察和分析一切万法，最终会通达了悟到它们都没有固定不变的自性，其本质是空无所有的。"
        }
      ],
      "image": "/images/zen-background.jpg",
      "originalTextUrl": "https://cbetaonline.dila.edu.tw/T0672"
    }
  ]
}
