{
  "stories": [
    {
      "id": "foolish-salt",
      "title": "愚人食盐",
      "content": "从前有个愚人，到朋友家做客，主人请他吃饭。他嫌菜没有味道，主人就在菜里加了些盐，他尝了后觉得非常美味。这愚人心想：菜的味道好，是因为有盐。只要一点点盐就这么好吃，那多吃些盐味道岂不更美？于是他就要主人给他盐，大口大口地吃起来，结果又苦又咸，苦不堪言。",
      "meaning": "修行要得其法，不可偏执一端。听闻佛法说持戒、念佛等有无量功德，就片面、极端地去执行，不理解其真实的义理和适宜的方法，结果反而会障碍修行，甚至伤害自己，如同那个只知吃盐却不懂用盐调味的愚人。",
      "source": "《百喻经》",
      "category": "智慧修行",
      "image": "/images/zen-stones.jpg"
    },
    {
      "id": "monkey-moon",
      "title": "渴见水中月",
      "content": "过去有一群猴子，在林中玩耍。领头的老猴来到一棵大树下，看到树下有口井，井里有月亮的倒影，又亮又圆。老猴就对其他猴子说：月亮今天掉到井里了，我们快把它捞上来，不然世界就要陷入黑暗了！于是猴子们一只接一只，首尾相连，倒挂着去井里捞月。结果因为太重，树枝断裂，所有的猴子都掉到井里淹死了。",
      "meaning": "世间的凡夫，执着于虚幻不实的我和我所，如同猴子捞水中之月，徒劳无功，反而因此在生死轮回中备受痛苦。佛法教导我们，要认识到一切现象皆是缘起性空，如梦如幻，才能从根本上破除执着，获得解脱。",
      "source": "《摩诃僧祇律》",
      "category": "执着虚妄",
      "image": "/images/lotus-flower.jpg"
    },
    {
      "id": "blind-elephant",
      "title": "瞎子摸象",
      "content": "一位国王叫来几个天生的瞎子，让他们去摸大象，并说出大象是什么样子的。摸到象牙的瞎子说：大象像一个大萝卜。摸到象耳朵的说：大象像一把大扇子。摸到象腿的说：大象像一根柱子。摸到象尾巴的说：大象像一条绳子。他们各执己见，争论不休，都认为自己是对的。",
      "meaning": "凡夫俗子对于佛法的理解，往往是片面的、局部的，如同瞎子摸象。每个人都可能只接触到佛法的一部分，便以为这就是佛法的全部，从而产生各种错误的见解和争论。真正的修行者应广泛听闻，圆融理解，才能把握佛法的全貌。",
      "source": "《大般涅槃经》",
      "category": "见解圆融",
      "image": "/images/zen-background.jpg"
    },
    {
      "id": "prince-tiger",
      "title": "萨埵太子舍身饲虎",
      "content": "佛陀在过去生为萨埵太子时，与两位兄长在林中游玩。他们看到一只母老虎刚生下几只小虎，因为饥饿而身体羸弱，甚至想要吃掉自己的孩子。太子心生大悲，想要救活这几只老虎。他支开兄长，躺在母老虎面前，但老虎已虚弱到无法张口。于是太子爬上山崖，用木枝刺破身体，纵身跳下，让母老虎依靠血腥味恢复力气，最终吃了他的肉身，救活了虎群。",
      "meaning": "这个故事彰显了菩萨道中最极致的慈悲与布施精神——为了救度众生，可以毫不犹豫地牺牲自己的一切，乃至生命。这是将无我与慈悲实践到了顶点。",
      "source": "《金光明经》、《贤愚经》",
      "category": "慈悲布施",
      "image": "/images/bodhi-leaf.jpg"
    },
    {
      "id": "poor-woman-lamp",
      "title": "贫女一灯",
      "content": "佛陀在世时，一位名叫难陀的贫女，靠乞讨为生。她看到国王大臣都在供养佛陀，心想自己也应该供养。她将乞讨所得的唯一一枚钱币，买了一点油来供灯。卖油人被她至诚的心感动，多给了她一些油。贫女发愿：愿此光明，能照破所有众生的无明黑暗。第二天，所有的灯都熄灭了，唯有贫女这盏灯依然光明不减，连神通第一的目犍连尊者也无法将其熄灭。佛陀说：因为这盏灯是以至诚的菩提心所点燃，所以功德无量，永不熄灭。",
      "meaning": "供养或布施的功德大小，不在于财物的多少，而在于发心是否真诚、清净。即便是一点微小的善行，若能以无上的恭敬心和广大的菩提心去做，其功德将不可思议。",
      "source": "《阿阇世王授决经》",
      "category": "至诚供养",
      "image": "/images/prayer-beads.jpg"
    },
    {
      "id": "painter-ghost",
      "title": "画师画鬼",
      "content": "有一位画师，技艺高超，能画世间万物。一位客人请他画一个鬼的形象。画师说：我没见过鬼，怎么画呢？客人说：你就凭想象画吧。画师闭门苦思，想象鬼的恐怖样子：青面獠牙、红发巨口。他越想越深入，越想越害怕，仿佛自己就要变成鬼一样，最后心神错乱，惊恐而死。",
      "meaning": "一切唯心造。我们的心念具有巨大的力量，能够创造出地狱，也能创造出天堂。如果心中总是充满着负面、邪恶的念头，最终会被这些念头所吞噬。修行就是要学会观照和转化自己的心念。",
      "source": "《杂譬喻经》",
      "category": "心念力量",
      "image": "/images/zen-stones.jpg"
    },
    {
      "id": "half-coin-merit",
      "title": "半个铜钱的福报",
      "content": "佛陀时代，一位长者请佛陀及僧众到家中应供。佛陀让弟子阿那律尊者观察，此次供养中谁的功德最大。阿那律用天眼观察后说，功德最大的不是长者，而是在门外欢喜赞叹的一位穷人。佛陀解释说，长者虽然供养丰盛，但有骄慢心和分别心。而那位穷人身无分文，却能对长者的善行生起至诚的随喜之心，这清净的一念使其功德超越了供养者。如果那位穷人有半个铜钱，他一定会全部捐出，他将来的福报不可限量。",
      "meaning": "随喜功德是佛法中非常殊胜的一种修行。当我们看到他人行善时，若能发自内心地赞叹和欢喜，就能获得与行善者同等的，甚至超越其上的功德。这教导我们要破除嫉妒心，常怀随喜之心。",
      "source": "《贤愚经》",
      "category": "随喜功德",
      "image": "/images/lotus-flower.jpg"
    },
    {
      "id": "good-intention-ghost",
      "title": "心存善念，恶鬼恭敬",
      "content": "两位比丘一同外出远行，路上口渴，看到一个盛满清水的骷髅头。一位比丘毫不犹豫地捧起水喝了。另一位比丘则先持咒，为骷髅头的主人祝愿，然后才喝水。晚上他们借宿在一户人家，夜里，一个恶鬼出现，想要殴打那位没持咒的比丘，却对另一位持咒的比丘非常恭敬。比丘问其原因，恶鬼说：被打的比丘喝水时，我正是那个骷髅头的主人，他无礼地喝水，我心生怨恨。而另一位比丘为我祝愿，使我得以超生，我对他心存感激，所以前来护卫。",
      "meaning": "起心动念至关重要。即便是微小的行为，若能心存善念、慈悲利他，就能感召善缘，化解恶缘。反之，看似无意的举动，若心怀轻慢，也可能种下恶因。修行者应时时观照自心，常怀感恩与慈悲。",
      "source": "《旧杂譬喻经》",
      "category": "心念感应",
      "image": "/images/buddhist-scripture.jpg"
    },
    {
      "id": "angulimala",
      "title": "鸯掘摩罗的转变",
      "content": "鸯掘摩罗（意为指鬘）是一位误入歧途的年轻人，他误信邪师，以为要杀满一千人，并将他们的手指串成项链才能得道。他已经杀害了999人，整个国家都为之震恐。当他要杀害自己的母亲以凑足一千人时，佛陀出现了。鸯掘摩罗转而追杀佛陀，却怎么也追不上。他大喊：停下来！佛陀平静地说：我早已停下，是你没有停下。鸯掘摩罗不解，佛陀解释说：我早已停止了杀戮和恶业，而你内心的贪嗔痴之火从未停息。鸯掘摩罗闻言大悟，放下屠刀，皈依佛陀，后来精进修行，证得阿罗汉果。",
      "meaning": "放下屠刀，立地成佛。无论过去曾犯下多大的罪业，只要能真心悔改，听闻正法，并依教奉行，就有可能彻底转变，走向解脱。佛法的大门向一切众生敞开，关键在于是否愿意停下内心的恶念。",
      "source": "《中阿含经·鸯掘摩经》",
      "category": "改过迁善",
      "image": "/images/zen-background.jpg"
    },
    {
      "id": "fool-counting-door",
      "title": "呆子数门",
      "content": "一个富翁有个傻儿子，只会数数。一天富翁要出远门，担心儿子一个人在家会出门乱跑，就命令他：你就待在家里，好好看着门，哪儿也别去。富翁走后，城里有庆典，傻儿子也想去看，但他记得父亲的嘱咐，不能离开门。他想了想，干脆把门拆下来，扛在背上，兴高采烈地去看庆典了。结果家里的财物被洗劫一空。",
      "meaning": "此故事比喻那些死守戒律条文，却不明其根本精神的修行人。他们执着于外在的形式，却忘记了持戒的根本目的是为了守护自己的清净心。如同那个只知道看住门板，却忘了门是为了保护家中财物的傻儿子一样，本末倒置，终究会一无所获。",
      "source": "《百喻经》",
      "category": "理解精神",
      "image": "/images/bodhi-leaf.jpg"
    }
  ],
  "categories": [
    {
      "id": "wisdom",
      "name": "智慧修行",
      "description": "关于修行方法和智慧培养的故事"
    },
    {
      "id": "compassion",
      "name": "慈悲布施",
      "description": "关于慈悲心和布施精神的故事"
    },
    {
      "id": "understanding",
      "name": "见解圆融",
      "description": "关于正确理解佛法的故事"
    },
    {
      "id": "mindfulness",
      "name": "心念感应",
      "description": "关于心念力量和感应的故事"
    },
    {
      "id": "reform",
      "name": "改过迁善",
      "description": "关于悔改和转变的故事"
    }
  ]
}
